# Series â€” 1D Labeled Array

In [1]:
import pandas as pd

In [2]:
s = pd.Series([34,87,24,86,68,92,69,85])

In [3]:
s

0    34
1    87
2    24
3    86
4    68
5    92
6    69
7    85
dtype: int64

In [4]:
s.dtype

dtype('int64')

In [5]:
type(s)

pandas.core.series.Series

In [6]:
student_marks = pd.Series([34,87,24,86,68,92] ,
                          index= ["Naman" , "Dhruv" , "Manish" , "Jay" , "Gopaldas" , "Ganesh"])

In [7]:
student_marks

Naman       34
Dhruv       87
Manish      24
Jay         86
Gopaldas    68
Ganesh      92
dtype: int64

In [8]:
student_marks["Dhruv"]

np.int64(87)

# DataFrame - 2D labeled Table

In [9]:
data = {
    "Name" : ["Dhruv" , "Jay" , "Ganesh"],
    "Age" : [25 , 20 , 44],
    "City" : ["Ahmedabad" , "Pune" , "Mumbai"]
}

In [10]:
df = pd.DataFrame(data)

In [11]:
df

     Name  Age       City
0   Dhruv   25  Ahmedabad
1     Jay   20       Pune
2  Ganesh   44     Mumbai

In [12]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [13]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [14]:
df.index = ["a", "b", "c"]
df.columns = ["Name", "Age", "City"]

In [15]:
df

     Name  Age       City
a   Dhruv   25  Ahmedabad
b     Jay   20       Pune
c  Ganesh   44     Mumbai